# Python Translation of File 1

### SDS Capstone Team

In [8]:
import pandas as pd
import numpy as np
from utils import *

In [9]:
import os

In [10]:
os.chdir("/Users/jmachita03/Desktop/Capstone/Stata Do Files & Data")

In [11]:
os.getcwd()

'/Users/jmachita03/Desktop/Capstone/Stata Do Files & Data'

## Replication

### CRTSE

In [13]:
crtse = pd.read_excel("2018_2019_CRTSE_SummerSecondary_PGMT_4thyrBMT_ItemsRemoved.xls", sheet_name='Sheet1')

In [14]:
crtse = basic(crtse)

In [15]:
crtse = new_col_mean(crtse, "crtse_total", first="crtse_05", last="crtse_41")

In [16]:
crtse.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,crtse_05,crtse_06,crtse_07,crtse_08,crtse_09,...,crtse_25,crtse_27,crtse_28,crtse_30,crtse_31,crtse_33,crtse_35,crtse_36,crtse_41,crtse_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",96,98,91,71,92,...,77,100,100,100,62,100,88,83,100,87.888889

### DAS

In [17]:
das = pd.read_excel("2018_2019_DAS_SummerSecondary_PGMT_4thyrBMT_Recoded_Missing_ItemNamesRemoved.xls", sheet_name='Sheet1')

In [18]:
das = basic(das)

In [19]:
das = new_col_mean(das, "das_depression", included=["das_03", "das_05", "das_10", "das_13", "das_16", "das_17", "das_21"])
das = new_col_mean(das, "das_anxiety", included=["das_02", "das_04", "das_07", "das_09", "das_15", "das_19", "das_20"])
das = new_col_mean(das, "das_stress", included=["das_01", "das_06", "das_08", "das_11", "das_12", "das_14", "das_18"])

In [20]:
das.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,das_01,das_02,das_03,das_04,das_05,...,das_15,das_16,das_17,das_18,das_19,das_20,das_21,das_depression,das_anxiety,das_stress
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",3,2,1,0,0,...,1,0,3,0,0,2,0,1.0,1.0,1.428571

### Demographic Data

#### Importing and Saving Demog Data

In [21]:
demog = pd.read_excel("2018_2019_Demography_Survey_SummerSecondary_PGMT.xls", sheet_name="Sheet1")

In [22]:
demog = lower_skip(demog)

In [23]:
demog.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,ccs_cohort,ccs_stutype,ccs_major,ccs_gpa,partch,...,hsses,hsrace,hsach,fustuses,fusturace,fustuach,futeases,futearace,futeaach,q37
1,2018-06-08 08:00:42,2273117.0,Alba,Elena,"McGraw,Jillian",1,2,American Studies and Religious Studies,3.86,1,...,2,2,3,2,2,3,2,2,3,"I chose UVA for a variety of reasons, includin..."

#### Importing and saving data from 2017-2018 for missing data

In [24]:
miss = pd.read_excel("2017_2018_CCS1_DemographySurvey_NumID_NoConsentRemoved.xlsx")

In [25]:
miss = lower_skip(miss)

In [26]:
miss.head(1)

,assessed,student,recipientlastname,recipientfirstname,ccs_cohort,ccs_stutype,ccs_major,ccs_gpa,partch,moedu,...,hsloc,hsses,hsrace,hsach,fustuses,fusturace,fustuach,futeases,futearace,futeaach
1,2017-09-14 05:05:54,2539029.0,All,Hannah,3,1,Art History,3.5,1,4,...,1,3,2,2,2,2,2,2,2,2

#### Append the datasets

In [27]:
demog_merged = append_data(demog, miss)

In [28]:
demog_merged = basic(demog_merged)

In [29]:
demog_merged = dates(demog_merged, "assessed")

In [30]:
demog_merged = demog_merged.query("student != 2176293 | assessed != '09162017'")

In [31]:
demog_merged.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,ccs_cohort,ccs_stutype,ccs_major,ccs_gpa,partch,...,hsses,hsrace,hsach,fustuses,fusturace,fustuach,futeases,futearace,futeaach,q37
0,06082018,2273117.0,Alba,Elena,"McGraw,Jillian",1,2,American Studies and Religious Studies,3.86,1,...,2,2,3,2,2,3,2,2,3,"I chose UVA for a variety of reasons, includin..."

### FIT

In [32]:
fit = pd.read_excel("2018_2019_FIT_SummerSecondary_PGMT_4thyrBMT_Recoded_ItemNamesRemoved.xls", sheet_name="Sheet1")

In [33]:
fit = basic(fit)

In [34]:
fit = new_col_mean(fit, "fit_total", first="fit_01", last="fit_13")

In [35]:
fit.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,fit_01,fit_04,fit_05,fit_06,fit_07,fit_08,fit_09,fit_10,fit_11,fit_12,fit_13,fit_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",5,5,1,5,7,7,7,2,1,4,7,4.636364

### GRIT

In [36]:
grit = pd.read_excel("2018_2019_GRIT_SummerSecondary_PGMT_4thyrBMT_ReverseCoded_OrigRemoved.xls", sheet_name="Sheet1")

In [37]:
grit = basic(grit)

In [38]:
grit = new_col_mean(grit, "grit_total", first="r_grit_02", last="r_grit_11")

In [39]:
grit.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,r_grit_02,grit_04,r_grit_05,grit_06,r_grit_07,r_grit_08,grit_09,grit_12,grit_01,r_grit_03,grit_10,r_grit_11,grit_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",2,1,1,1,3,2,1,1,1,3,1,5,1.833333

### IMTS

In [40]:
imts = pd.read_excel("2018_2019_IMTS_SummerSecondary_PGMT_4thyrBMT_Missing_ItemNamesRemoved.xls", sheet_name="Sheet1")

In [41]:
imts = basic(imts)

In [42]:
imts = new_col_mean(imts, "imts_total", first="imts_01", last="imts_05")

In [43]:
imts.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,imts_01,imts_02,imts_03,imts_04,imts_05,imts_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",5,4,4,3,4,4.0

### NEO

#### Importing Neo

In [44]:
neo = pd.read_excel("2018_2019_NEO_SummerSecondary_PGMT_ReverseCoded_OrigRemoved.xls", sheet_name="Sheet1")

In [45]:
neo = lower_skip(neo)

In [46]:
neo = basic(neo)

In [47]:
neo.r_neo_01.dtypes

dtype('float64')

In [48]:
neo.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,r_neo_01,neo_02,r_neo_03,neo_04,neo_05,...,neo_51,neo_52,neo_53,r_neo_54,r_neo_55,neo_56,r_neo_57,neo_58,r_neo_59,neo_60
1,2018-06-08 08:00:42,2273117.0,Alba,Elena,"McGraw,Jillian",4.0,4,4.0,5,4,...,2,5,5,4.0,4.0,3,2.0,3,4.0,5

#### Importing Contact List

In [49]:
contact = pd.read_excel("Student_Contact_2018_2019.xls")

In [50]:
contact.head(1)

,student,name,universitycomputingid,studentacademicyr,email
0,2273117,"Alba,Elena M",ema4ex,NaN,ema4ex@virginia.edu

#### Merge Neo and Contact List

In [51]:
neo_merged = neo.merge(contact, on='student', how='left')

In [52]:
neo_merged = neo_merged.drop(['name', 'universitycomputingid', 'studentacademicyr'], axis=1)

In [53]:
neo_merged.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,r_neo_01,neo_02,r_neo_03,neo_04,neo_05,...,neo_52,neo_53,r_neo_54,r_neo_55,neo_56,r_neo_57,neo_58,r_neo_59,neo_60,email
0,2018-06-08 08:00:42,2273117.0,Alba,Elena,"McGraw,Jillian",4.0,4,4.0,5,4,...,5,5,4.0,4.0,3,2.0,3,4.0,5,ema4ex@virginia.edu

#### Import 2017 Data

In [54]:
neo_2017 = pd.read_excel("NEO 2017 09 27.xlsx")

In [55]:
neo_2017 = lower_skip(neo_2017)

In [56]:
neo_2017 = neo_2017.rename({"recipientemail":"email"}, axis=1)

In [57]:
neo_2017 = neo_2017.sort_values(by='recipientfirstname', ascending=True)

In [58]:
neo_2017.head(1)

,recipientlastname,recipientfirstname,email,neo_1,neo_2,neo_3,neo_4,neo_5,neo_6,neo_7,...,neo_51,neo_52,neo_53,neo_54,neo_55,neo_56,neo_57,neo_58,neo_59,neo_60
29,Copley,Abigail,ac4ah@virginia.edu,3,2,4,4,4,2,3,...,2,4,4,3,2,3,2,4,3,4

#### Merging with contact list to get student numbers

In [59]:
neo_2017_merged = neo_2017.merge(contact, on='email', how='outer')

In [60]:
neo_2017_merged = neo_2017_merged.drop(['name', 'universitycomputingid', 'studentacademicyr'], axis=1)

In [61]:
neo_2017_merged = basic(neo_2017_merged)

In [62]:
neo_2017_merged.head(1)

,recipientlastname,recipientfirstname,email,neo_1,neo_2,neo_3,neo_4,neo_5,neo_6,neo_7,...,neo_52,neo_53,neo_54,neo_55,neo_56,neo_57,neo_58,neo_59,neo_60,student
0,Copley,Abigail,ac4ah@virginia.edu,3,2,4,4,4,2,3,...,4,4,3,2,3,2,4,3,4,2598400.0

#### Reverse coding management approaches scale

In [63]:
neo_2017_merged = destring(neo_2017_merged, first="neo_1", last="neo_60")

In [64]:
include = ["neo_1", "neo_3", "neo_8", "neo_9", "neo_12", "neo_14", "neo_15", "neo_16", "neo_18", "neo_23", \
           "neo_24", "neo_27", "neo_29", "neo_30", "neo_31", "neo_33", "neo_38", "neo_39", "neo_42", \
           "neo_44", "neo_45", "neo_46", "neo_48", "neo_54", "neo_55", "neo_57", "neo_59"]
neo_2017_merged = recode(neo_2017_merged, include)

In [65]:
neo_2017_merged = neo_2017_merged.rename({"r_neo_1": "r_neo_01",
                                         "neo_2": "neo_02",
                                         "r_neo_3": "r_neo_03",
                                         "neo_4": "neo_04",
                                         "neo_5": "neo_05",
                                         "neo_6": "neo_06",
                                         "neo_7": "neo_07",
                                         "r_neo_8": "r_neo_08",
                                         "r_neo_9": "r_neo_09"}, axis=1)

In [66]:
neo_2017_merged = neo_2017_merged.dropna(subset=['r_neo_01'])

In [67]:
neo_2017_merged.head(1)

,recipientlastname,recipientfirstname,email,neo_02,neo_04,neo_05,neo_06,neo_07,neo_10,neo_11,...,r_neo_39,r_neo_42,r_neo_44,r_neo_45,r_neo_46,r_neo_48,r_neo_54,r_neo_55,r_neo_57,r_neo_59
0,Copley,Abigail,ac4ah@virginia.edu,2.0,4.0,4.0,2.0,3.0,4.0,3.0,...,4.0,4.0,3.0,4.0,3.0,4.0,3.0,4.0,4.0,3.0

#### Appending datasets

Note: "2018_2019_NEO1_Data.dta" is the dataframe neo_merged above

In [68]:
appended = append_data(neo_2017_merged, neo_merged)

In [69]:
# create column with how many times student occurs
appended['Count'] = appended.groupby('student')['student'].transform('count')

In [70]:
appended = appended.query("Count==1 | email != '' ")

In [71]:
appended = appended.drop(['Count'], axis=1)

In [72]:
appended = new_col_mean(appended, "neo_n", included=["r_neo_01", "neo_06", "neo_11", "r_neo_16", \
                                          "neo_21", "neo_26", "r_neo_31", "neo_36", "neo_41", \
                                          "r_neo_46", "neo_51", "neo_56"])

In [73]:
appended = new_col_mean(appended, "neo_e", included=["neo_02", "neo_07", "r_neo_12", "neo_17", \
                                                   "neo_22", "r_neo_27", "neo_32", "neo_37", \
                                                   "r_neo_42", "neo_47", "neo_52", "r_neo_57"])

In [74]:
appended = new_col_mean(appended, "neo_o", included=["r_neo_03", "r_neo_08", "neo_13", "r_neo_18", \
                                                   "r_neo_23", "neo_28", "r_neo_33", "r_neo_38", \
                                                   "neo_43", "r_neo_48", "neo_53", "neo_58"])

In [75]:
appended = new_col_mean(appended, "neo_a", included=["neo_04", "r_neo_09", "r_neo_14", "neo_19", \
                                                   "r_neo_24", "r_neo_29", "neo_34", "r_neo_39", \
                                                   "r_neo_44", "neo_49", "r_neo_54", "r_neo_59"])

In [76]:
appended = new_col_meannewColMean(appended, "neo_c", included=["neo_05", "neo_10", "r_neo_15", "neo_20", "neo_25", \
                                                   "r_neo_30", "neo_35", "neo_40", "r_neo_45", "neo_50", \
                                                   "r_neo_55", "neo_60"])

In [77]:
appended.head(1)

,recipientlastname,recipientfirstname,email,neo_02,neo_04,neo_05,neo_06,neo_07,neo_10,neo_11,...,r_neo_55,r_neo_57,r_neo_59,assessed,assessor,neo_n,neo_e,neo_o,neo_a,neo_c
0,Copley,Abigail,ac4ah@virginia.edu,2,4,4,2,3,4,3,...,4.0,4.0,3.0,NaN,NaN,2.666667,3.416667,3.333333,3.583333,3.583333

#### Merging with missing data to update

In [78]:
missing = pd.read_excel("2018_2019_NEO_Missing.xls")

In [79]:
missing.columns = missing.columns.str.lower()

In [80]:
missing = new_col_mean(missing, "neo_n", included=["r_neo_01", "neo_06", "neo_11", "r_neo_16", \
                                          "neo_21", "neo_26", "r_neo_31", "neo_36", "neo_41", \
                                          "r_neo_46", "neo_51", "neo_56"])

In [81]:
missing = new_col_mean(missing, "neo_e", included=["neo_02", "neo_07", "r_neo_12", "neo_17", \
                                                   "neo_22", "r_neo_27", "neo_32", "neo_37", \
                                                   "r_neo_42", "neo_47", "neo_52", "r_neo_57"])

In [82]:
missing = new_col_mean(missing, "neo_o", included=["r_neo_03", "r_neo_08", "neo_13", "r_neo_18", \
                                                   "r_neo_23", "neo_28", "r_neo_33", "r_neo_38", \
                                                   "neo_43", "r_neo_48", "neo_53", "neo_58"])

In [83]:
missing = new_col_mean(missing, "neo_a", included=["neo_04", "r_neo_09", "r_neo_14", "neo_19", \
                                                   "r_neo_24", "r_neo_29", "neo_34", "r_neo_39", \
                                                   "r_neo_44", "neo_49", "r_neo_54", "r_neo_59"])

In [84]:
missing = new_col_mean(missing, "neo_c", included=["neo_05", "neo_10", "r_neo_15", "neo_20", "neo_25", \
                                                   "r_neo_30", "neo_35", "neo_40", "r_neo_45", "neo_50", \
                                                   "r_neo_55", "neo_60"])

In [85]:
missing = missing.drop(['assessed', 'assessor'], axis=1)

In [86]:
missing.head(1)

,name,email,program,section,student,recipientlastname,recipientfirstname,r_neo_01,neo_02,r_neo_03,...,neo_56,r_neo_57,neo_58,r_neo_59,neo_60,neo_n,neo_e,neo_o,neo_a,neo_c
0,"Atkeson,Kate",kra2fn@virginia.edu,elementary,Monday,2542858.0,Atkeson,Katherine,4.0,3.0,4.0,...,2.0,3.0,3.0,4.0,3.0,2.916667,3.833333,4.0,4.5,3.666667

#### Merging Two Datasets

In [87]:
# "2018_2019_NEO_Data.dta" is stored as the dataframe "appended"
# "2018_2019_NEO_Missing_Cleaned.dta" is stored as the dataframe "missing"
# this df final_neo becomes "2018_2019_NEO_Data.dta"
final_neo = appended.merge(missing[['student', 'name', 'program', 'section']], on='student', how='outer')

In [88]:
final_neo.head(1)

,recipientlastname,recipientfirstname,email,neo_02,neo_04,neo_05,neo_06,neo_07,neo_10,neo_11,...,assessed,assessor,neo_n,neo_e,neo_o,neo_a,neo_c,name,program,section
0,Copley,Abigail,ac4ah@virginia.edu,2,4,4,2,3,4,3,...,NaN,NaN,2.666667,3.416667,3.333333,3.583333,3.583333,NaN,NaN,NaN

### RSQ

In [89]:
rsq = pd.read_excel("2018_2019_RSQ_SummerSecondary_PGMT_ReverseCoded_OrigRemoved.xls", sheet_name="Sheet1")

In [90]:
rsq.columns = rsq.columns.str.lower()

In [91]:
rsq.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,r_rsq_01,rsq_03,r_rsq_05,r_rsq_07,rsq_10,...,r_rsq_13,r_rsq_17,r_rsq_20,r_rsq_21,r_rsq_23,r_rsq_24,rsq_27,r_rsq_28,r_rsq_29,rsq_30
0,2018-06-08 08:00:42,2273117.0,Alba,Elena,"McGraw,Jillian",2,4,4,2,2,...,3,4,3,2,2,4,3,5,4,4

In [92]:
rsq2 = pd.read_excel("2018_2019_RSQ_Missing.xlsx")

In [93]:
rsq2.columns = rsq2.columns.str.lower()

In [94]:
rsq2.head(1)

,name,email,program,section,assessed,student,recipientlastname,recipientfirstname,assessor,r_rsq_01,...,r_rsq_13,r_rsq_17,r_rsq_20,r_rsq_21,r_rsq_23,r_rsq_24,rsq_27,r_rsq_28,r_rsq_29,rsq_30
0,"All,Hannah",haa8kt@virginia.edu,elementary,Monday,2017-09-14 05:05:54,2539029.0,All,Hannah,"McGraw, Jillian",5.0,...,5.0,5.0,5.0,5.0,5.0,5.0,5.0,2.0,5.0,4.0

In [95]:
allRSQ = append_data(rsq2, rsq)

In [96]:
allRSQ.loc[allRSQ.name=="Gross,Hannah","student"] = 2603880

In [97]:
allRSQ = basic(allRSQ)

In [98]:
allRSQ = new_col_mean(allRSQ, "rsq_total", first="r_rsq_01", last="rsq_30")

In [99]:
allRSQ.head(1)

,name,email,program,section,assessed,student,recipientlastname,recipientfirstname,assessor,r_rsq_01,...,r_rsq_17,r_rsq_20,r_rsq_21,r_rsq_23,r_rsq_24,rsq_27,r_rsq_28,r_rsq_29,rsq_30,rsq_total
0,"All,Hannah",haa8kt@virginia.edu,elementary,Monday,2017-09-14 05:05:54,2539029.0,All,Hannah,"McGraw, Jillian",5.0,...,5.0,5.0,5.0,5.0,5.0,5.0,2.0,5.0,4.0,4.705882

### TMAS

In [100]:
tmas = pd.read_excel("2018_2019_TMAS_SummerSecondary_PGMT_4thyrBMT_Missing_ReverseCoded_OrigRemoved_ItemNamesRemoved.xls", sheet_name="Sheet1")

In [101]:
tmas = basic(tmas)

In [102]:
tmas = new_col_mean(tmas, "tmas_total", first="tmas_01", last="r_tmas_20")

In [103]:
tmas.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,tmas_01,tmas_02,r_tmas_03,tmas_04,r_tmas_06,...,r_tmas_12,tmas_13,tmas_14,r_tmas_15,r_tmas_16,tmas_17,tmas_18,r_tmas_19,r_tmas_20,tmas_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",5,5,5,5,5,...,5,5,5,5,1,5,5,5,5,4.647059

### TSE

In [104]:
tse = pd.read_excel("2018_2019_TSE_SummerSecondary_PGMT_4thyrBMT.xls", sheet_name="Sheet1")

In [105]:
tse = basic(tse)

In [106]:
tse = new_col_mean(tse, "tses_se", included=["tse_01", "tse_02", "tse_04", "tse_06", "tse_09", "tse_12", "tse_14", "tse_22"])

In [107]:
tse = new_col_mean(tse, "tses_is", included=["tse_07", "tse_10", "tse_11", "tse_17", "tse_18", "tse_20", "tse_23", "tse_24"])

In [108]:
tse = new_col_mean(tse, "tses_cm", included=["tse_03", "tse_05", "tse_08", "tse_13", "tse_15", "tse_16", "tse_19", "tse_21"])

In [109]:
tse = new_col_mean(tse, "tses_total", included=["tse_01", "tse_02", "tse_04", "tse_06", "tse_09", "tse_12", \
                                              "tse_14", "tse_22", "tse_07", "tse_10", "tse_11", "tse_17", \
                                              "tse_18", "tse_20", "tse_23", "tse_24", "tse_03", "tse_05", \
                                              "tse_08", "tse_13", "tse_15", "tse_16", "tse_19", "tse_21"])

In [110]:
tse.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,tse_03,tse_04,tse_15,tse_09,tse_11,...,tse_12,tse_14,tse_17,tse_19,tse_21,tse_24,tses_se,tses_is,tses_cm,tses_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",8,8,8,9,8,...,9,8,8,8,8,8,8.125,8.25,8.0,8.125

### YTRT

In [111]:
ytrt = pd.read_excel("2018_2019_YTRT_SummerSecondary_PGMT_4thyrBMT_Missing_ItemNamesRemoved.xls", sheet_name="Sheet1")

In [112]:
ytrt = basic(ytrt)

In [113]:
ytrt = new_col_mean(ytrt, "ytrt_total", first="ytrt_01", last="ytrt_05")

In [114]:
ytrt.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,ytrt_01,ytrt_02,ytrt_03,ytrt_04,ytrt_05,ytrt_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",4,1,7,6,5,4.6

## Merging All Datasets

In [115]:
full = ytrt[['student', 'ytrt_total', 'recipientlastname', 'recipientfirstname']]

In [116]:
full = full.merge(crtse[['student', 'crtse_total']], on='student', how='outer')

In [117]:
full = full.merge(das[['student', 'das_depression', 'das_anxiety', 'das_stress']], on='student', how='outer')

In [118]:
keep = list(demog_merged.loc[:, 'ccs_gpa':'hsach'].columns)
keep.append('student')
full = full.merge(demog_merged[keep], on='student', how='left')

In [119]:
full = full.merge(fit[['student', 'fit_total']], on='student', how='outer')

In [120]:
full = full.merge(grit[['student', 'grit_total']], on='student', how='outer')

In [121]:
full = full.merge(imts[['student', 'imts_total']], on='student', how='outer')

In [122]:
full = full.merge(final_neo[['student', 'neo_n', 'neo_e', 'neo_o', 'neo_a', 'neo_c']], on='student', how='left')

In [123]:
full = full.merge(allRSQ[['recipientlastname', 'recipientfirstname', 'rsq_total']], on=['recipientlastname', 'recipientfirstname'], how='left')

In [124]:
full = full.merge(tmas[['recipientlastname', 'recipientfirstname', 'tmas_total']], on=['recipientlastname', 'recipientfirstname'], how='outer')

In [125]:
full = full.merge(tse[['recipientlastname', 'recipientfirstname', 'tses_se', 'tses_is', 'tses_cm','tses_total']], on=['recipientlastname', 'recipientfirstname'], how='outer')

In [126]:
full['name'] = full['recipientlastname'] + "," + full['recipientfirstname']

In [127]:
full = full.sort_values(by=['recipientlastname'], ascending=True)

In [128]:
full#.head(1)

,student,ytrt_total,recipientlastname,recipientfirstname,crtse_total,das_depression,das_anxiety,das_stress,ccs_gpa,partch,...,neo_o,neo_a,neo_c,rsq_total,tmas_total,tses_se,tses_is,tses_cm,tses_total,name
1,2273117.0,6.4,Alba,Elena,61.481481,0.142857,0.142857,0.857143,3.86,1,...,4.250000,4.250000,4.250000,3.117647,4.411765,7.000,7.375,6.875,7.083333,"Alba,Elena"
2,2539029.0,6.6,All,Hannah,77.407407,0.285714,0.142857,1.000000,3.5,1,...,3.166667,3.416667,4.333333,4.705882,4.000000,7.750,7.125,7.125,7.333333,"All,Hannah"
3,2745617.0,5.6,Appleton,Megan,44.222222,0.428571,0.714286,0.714286,3.99,4,...,3.500000,4.416667,4.083333,2.647059,4.647059,5.250,2.875,4.625,4.250000,"Appleton,Megan"
4,2542858.0,6.0,Atkeson,Katherine,80.740741,0.285714,0.142857,0.571429,3.357,4,...,NaN,NaN,NaN,3.647059,4.470588,5.625,4.875,4.500,5.000000,"Atkeson,Katherine"
5,2701709.0,6.6,Baber,Lauren,65.925926,0.000000,0.285714,0.714286,NaN,4,...,3.500000,4.500000,4.750000,4.000000,4.823529,6.750,7.250,7.000,7.000000,"Baber,Lauren"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
111,2635681.0,6.4,Winkler,Lily,77.777778,0.857143,1.571429,1.857143,3.3,4,...,4.166667,4.583333,3.833333,4.235294,4.588235,6.750,5.875,6.500,6.375000,"Winkler,Lily"
112,2485660.0,5.4,Wright,Joseph,50.148148,0.428571,0.571429,0.857143,3.16,4,...,3.750000,3.416667,3.333333,2.764706,4.352941,5.625,6.625,5.625,5.958333,"Wright,Joseph"
113,2592977.0,5.8,Xin,Christie,76.185185,0.142857,0.000000,0.000000,3.77,4,...,3.583333,4.000000,3.416667,4.352941,4.529412,5.875,6.000,6.500,6.125000,"Xin,Christie"
114,2524000.0,6.8,Yancey,Katherine,26.592593,0.142857,0.428571,0.857143,3.6,4,...,4.666667,3.416667,4.500000,3.470588,4.529412,4.750,3.750,4.625,4.375000,"Yancey,Katherine"
115,2543571.0,7.0,Yang,Hannah,94.740741,0.000000,0.000000,0.142857,3.55,4,...,3.583333,3.083333,3.916667,3.235294,4.941176,7.750,8.000,8.000,7.916667,"Yang,Hannah"

### Merging with contact info to get emails and filling in blank emails

In [129]:
final = full.merge(contact[['student', 'email']], on='student', how='outer')

In [1]:
combo = {
'1382103':'set9x@virginia.edu',
'1498517':"sem4u@virginia.edu",
'2176293':"amh3ej@virginia.edu",
'2200476':"mih3f@virginia.edu",
'2437606':"ckb4y@virginia.edu",
'2468766':"npg7wf@virginia.edu",
'2498051':"hjk9dr@virginia.edu",
'2502859':"cjt4te@virginia.edu",
'2571818':"hwr9ex@virginia.edu",
'2605170':"rml3x@virginia.edu",
'2699159':"esw4au@virginia.edu",
'2699239':"rb2rf@virginia.edu",
'2699474':"smj6t@virginia.edu",
'2704548':"hw8kw@virginia.edu",
'2732302':"hlh9j@virginia.edu",
'2732372':"cml2zq@virginia.edu",
'2744059':"amh9gu@virginia.edu",
'2745617':"mca5hu@virginia.edu",
'2747552':"leo9um@virginia.edu",
'2760226':"ncb8q@virginia.edu",
'2761355':"joh2va@virginia.edu",
'2762920':"bfd8er@virginia.edu",
'2766444':"lck4hk@virginia.edu",
'2767343':"kno9b@virginia.edu",
'2767980':"oce7ph@virginia.edu",
'2772863':"es8fa@virginia.edu",
'2775384':"cc3vm@virginia.edu"}

In [153]:
emails = pd.DataFrame({'student':list(combo.keys()), 'email':list(combo.values())})

In [7]:
emails.to_csv("Student_Emails.csv")

In [150]:
final = replace_emails(final, "Student_Emails.csv")

In [152]:
final.loc[final.student==2502859,"email"]

103    cjt4te@virginia.edu
Name: email, dtype: object

In [125]:
final.head(1)

,student,ytrt_total,recipientlastname,recipientfirstname,crtse_total,das_depression,das_anxiety,das_stress,ccs_gpa,partch,...,neo_a,neo_c,rsq_total,tmas_total,tses_se,tses_is,tses_cm,tses_total,name,email
0,2273117.0,6.4,Alba,Elena,61.481481,0.142857,0.142857,0.857143,3.86,1,...,4.25,4.25,3.117647,4.411765,7.0,7.375,6.875,7.083333,"Alba,Elena",ema4ex@virginia.edu

## Step 2: Cleaning Data

In [126]:
final = destring(final, included=['age'])

In [127]:
replace_map = {
    2:1, 3:1, 4:1, 5:1, 1:0
}

final["age_21ab"] = final["age"].replace(replace_map)

In [128]:
final = col_missing_vals(final, "age_21ab")

In [129]:
# tab, gen() does dummy encoding essentially
replace_map1 = {1:1, 2:0, 3:0}
replace_map2 = {1:0, 2:1, 3:0}
replace_map3 = {1:0, 2:0, 3:1}

final['hsloc_1'] = final.hsloc.replace(replace_map1)
final['hsloc_2'] = final.hsloc.replace(replace_map2)
final['hsloc_3'] = final.hsloc.replace(replace_map3)

In [130]:
final['hsses_1'] = final.hsses.replace(replace_map1)
final['hsses_2'] = final.hsses.replace(replace_map2)
final['hsses_3'] = final.hsses.replace(replace_map3)

In [131]:
final['hsrace_1'] = final.hsrace.replace(replace_map1)
final['hsrace_2'] = final.hsrace.replace(replace_map2)
final['hsrace_3'] = final.hsrace.replace(replace_map3)

In [132]:
final['hsach_1'] = final.hsach.replace(replace_map1)
final['hsach_2'] = final.hsach.replace(replace_map2)
final['hsach_3'] = final.hsach.replace(replace_map3)

In [133]:
replace_map = {
    "2,5":2, "3,5":3
}

final.race = final.race.replace(replace_map)

In [134]:
final = destring(final, included=['race'])

In [135]:
replace_map = {5:1, 2:0, 3:0, 4:0, 1:0}
final["race_white"] = final.race.replace(replace_map)

In [136]:
final = col_missing_vals(final, "race_white")

In [137]:
final = destring(final, included=['hsses', 'hsach'])

In [138]:
final = col_missing_vals(final, "hsses")

In [139]:
final = col_missing_vals(final, "hsach")

In [140]:
final = destring(final, included=['partch'])

In [141]:
replace_map = {1:1, 2:1, 3:1, 4:0}
final["partch_either"] = final.partch.replace(replace_map)

In [142]:
final = destring(final, included=['moedu', 'faedu'])

In [143]:
replace_map = {3:1, 4:1, 5:1, 2:0, 1:0}
final["moedu_colab"] = final.moedu.replace(replace_map)

In [144]:
replace_map = {3:1, 4:1, 5:1, 2:0, 1:0}
final["faedu_colab"] = final.faedu.replace(replace_map)

In [145]:
final.gender = final.gender.str.strip().str.lower()

In [146]:
replace_map = {'female':1, 'woman':1, 'male':0, 'm':0}
final["gender_female"] = final.gender.replace(replace_map)

In [147]:
final = col_missing_vals(final, "gender_female")

In [148]:
replace_map = {"3.6??":"3.6"}
final["ccs_gpa"] = final.ccs_gpa.replace(replace_map)

In [149]:
final = destring(final, included=['ccs_gpa'])

In [150]:
final#.head(1)

,student,ytrt_total,recipientlastname,recipientfirstname,crtse_total,das_depression,das_anxiety,das_stress,ccs_gpa,partch,...,hsach_3,race_white,race_white_miss,hsses_miss,hsach_miss,partch_either,moedu_colab,faedu_colab,gender_female,gender_female_miss
0,2273117.0,6.4,Alba,Elena,61.481481,0.142857,0.142857,0.857143,3.860,1.0,...,1.0,1.0,0.0,0.0,0.0,1.0,1.0,0.0,1.0,0.0
1,2539029.0,6.6,All,Hannah,77.407407,0.285714,0.142857,1.000000,3.500,1.0,...,0.0,1.0,0.0,0.0,0.0,1.0,1.0,1.0,1.0,0.0
2,2745617.0,5.6,Appleton,Megan,44.222222,0.428571,0.714286,0.714286,3.990,4.0,...,1.0,1.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0,0.0
3,2542858.0,6.0,Atkeson,Katherine,80.740741,0.285714,0.142857,0.571429,3.357,4.0,...,1.0,1.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0,0.0
4,2701709.0,6.6,Baber,Lauren,65.925926,0.000000,0.285714,0.714286,NaN,4.0,...,1.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
113,2592977.0,5.8,Xin,Christie,76.185185,0.142857,0.000000,0.000000,3.770,4.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0,0.0
114,2524000.0,6.8,Yancey,Katherine,26.592593,0.142857,0.428571,0.857143,3.600,4.0,...,0.0,1.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0,0.0
115,2543571.0,7.0,Yang,Hannah,94.740741,0.000000,0.000000,0.142857,3.550,4.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0,0.0
116,2534432.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0
117,2703418.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0

## Merge with Randomized Information

In [151]:
rand = pd.read_excel("SimTeacher Randomization Fall 2018 Spring 2019.xls")

In [152]:
rand = rand.rename({'Email':'email'}, axis=1).drop(['name'], axis=1)

In [153]:
full = final.merge(rand, on='email', how='outer')

In [154]:
full # the resulting dataset of the file

,student,ytrt_total,recipientlastname,recipientfirstname,crtse_total,das_depression,das_anxiety,das_stress,ccs_gpa,partch,...,rannum,temp,numofstudents,tr_n,ra,fall2018coachingra,fall2018racera,fall2018coachingnotes,spring2019coachingra,spring2019racera
0,2273117.0,6.4,Alba,Elena,61.481481,0.142857,0.142857,0.857143,3.860,1.0,...,0.730109,25.0,33.0,8.0,TW,Coaching,White,No notes,No Coaching,Black
1,2539029.0,6.6,All,Hannah,77.407407,0.285714,0.142857,1.000000,3.500,1.0,...,0.230620,8.0,39.0,10.0,CB,No Coaching,Black,No coaching conversation,Coaching,White
2,2745617.0,5.6,Appleton,Megan,44.222222,0.428571,0.714286,0.714286,3.990,4.0,...,0.213969,9.0,36.0,9.0,CB,No Coaching,Black,No coaching conversation,Coaching,White
3,2542858.0,6.0,Atkeson,Katherine,80.740741,0.285714,0.142857,0.571429,3.357,4.0,...,0.594512,22.0,39.0,10.0,TB,Coaching,Black,Coaching conversation,No Coaching,Black
4,2701709.0,6.6,Baber,Lauren,65.925926,0.000000,0.285714,0.714286,NaN,4.0,...,0.323117,15.0,39.0,10.0,CW,No Coaching,White,No coaching conversation,No Coaching,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
115,2543571.0,7.0,Yang,Hannah,94.740741,0.000000,0.000000,0.142857,3.550,4.0,...,0.301566,12.0,39.0,10.0,CW,No Coaching,White,No coaching conversation,Coaching,White
116,2534432.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.733051,26.0,36.0,9.0,TB,Coaching,Black,Coaching conversation,No Coaching,White
117,2703418.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
118,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.925287,30.0,33.0,8.0,TW,Coaching,White,No notes,No Coaching,Black
119,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.701000,25.0,39.0,10.0,TB,Coaching,Black,No notes,Coaching,Black

## Write Output to CSV

In [159]:
full.to_csv('output_01_cpp_clean.csv')